.cf.xml/Catalogs/обм_ПакетыДанных.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>обм_ПакетыДанных</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.обм_ВходящиеСообщения</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Узел</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_узел</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_категория</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.обм_ид</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_sha256</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.общ_sha256</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Данные_Длина</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.общ_Обработчики</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>254</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

.cf.xml/Catalogs/обм_ПакетыДанных/Ext/ObjectModule.bsl
Процедура ПередЗаписью(Отказ) 
	
	общ.СправочникОбъект_УстановитьУИДкакКод(ЭтотОбъект);

	ЭтотОбъект.Наименование =
		СтрШаблон(
			"%1 %2 ид: %3 владелец: %4",
			Узел, // %1
			Категория, // %2
			Идентификатор, // %3
			Строка(ЭтотОбъект.Владелец.УникальныйИдентификатор()) // %4
			);

		Данные_Длина = СтрДлина(Данные);

	Если Не ПустаяСтрока(Данные) Тогда
		Хеширование = Новый ХешированиеДанных(ХешФункция.sha256);
		Хеширование.Добавить(Данные);
		Данные_sha256 = Строка(Хеширование.ХешСумма);
		
	Иначе
		Данные = Неопределено;
		Данные_sha256 = Неопределено;
		
	КонецЕсли;

	Если ПустаяСтрока(Данные_sha256) Тогда
		Данные_sha256 = Неопределено;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.ДатаВремя) Тогда
		ЭтотОбъект.ДатаВремя = общ_Сервер.ТекущаяДатаНаСервере();
		
	КонецЕсли;
		
КонецПроцедуры
